data/sysbench/ext4_log/rndwr/150G/nvme0n1thread50
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     108964.20
    fsyncs/s:                     108964.20

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               1702.57

General statistics:
    total time:                          60.0006s
    total number of events:              6538269

Latency (ms):
         min:                                  0.03
         avg:                                  0.42
         max:                                 20.28
         95th percentile:                      0.97
         sum:                            2724016.29

Threads fairness:
    events (avg/stddev):           130765.3800/32299.33
    execution time (avg/stddev):   54.4803/13.17